/*
	复习C语言中的字符串的内容，之前没弄懂这些基本概念，出了很多差错*/
#include <stdio.h>
#include <string.h>

int main(int argc, char const *argv[])
{
	/*字符串的声明及初始化～～～～～～～～～～～～～～～*/
	char *str = "Hello";
	// 系统自动在最后一个字符后面加了一个'\0',不指定字符串的个数系统会自动数，字符串长度为 字符个数+1
	char str1[20] = "0 \0";
	// 指定其长度，超出的部分无法赋值，字符串就是字符数组，字符数组长度必须为 所有要赋值字符的个数+1

	printf("str:%s,str1:%s \n", str,str1);
	// %s是输出字符串时所用的格式符，定义在string.h中。printf()函数会输出str所指向的字符串的第一个字符，然后自动时str加1，使之指向下一个字符，再输出该字符，直到遇到字符串结束标志'\0'为止。在内存中所有的字符串的最后被自动加上了一个'\0'，因此在输出时能确定输出的字符到何时结束。
	printf("str:%lu,str:%lu\n", strlen(str),strlen(str1));
	// strlen()函数所测的字符串长度仅仅是字符的个数，不包括最后的字符串结束标志'\0'.
	/*～～～～～～～～～～～～～～～～～～～～～～～～～*/


	/*字符串函数～～～～～～～～～～～～～～～～～～～*/
	strcpy(str1,"world");
	/*strcpy()是字符串复制函数，不能直接用等号赋值
		1. str1 必须定义地足够大，以便容纳被复制的字符串。str1必须长度大于第二个
		2. str1 必须写成数组名的形式，字符串2可以是字符串也可以是字符串常量
		3. 如果没有给str1 初始化，那么其中的内容是未知的。复制时将第二个字符串包括'\0'也一起赋给str1中的前几个字符，后面没有复制的不一定是'\0',还是原来的内容
		4. 可以用strncpy(str1,str2,n) 将str2中的前n个字符复制到str1中*/
	printf("%s\n", str1);


    strcat(str1," world");
	/*strcat()是字符串拼接函数
		1. str1 必须定义地足够大，以便容纳被复制的字符串。str1必须长度大于第二个。如果声明时不指定str1的长度，就无法复制，直接内存泄漏
		2. 连接前两个字符串都有'\0',连接时去掉str1的'\0',只保留第二个*/
	printf("%s\n", str1);

	return 0;
}